testing_cases/officeDVTian2019_PSPM/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.01035;

boundaryField
{   
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(wall_.*|closet|manikin|unit|desk|monitor|fluorescent_.*)"
    {
        type            zeroGradient;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
        value           $internalField;
    }
}

// ************************************************************************* //
