testing_cases/officeDVTian2019_PSPM/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{   
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(wall_.*|closet|manikin|unit|desk|monitor|fluorescent_.*)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    outlet
    {
        type            prghTotalPressure;
        p0              $internalField;
    }
}


// ************************************************************************* //
