testing_cases/officeDVTian2019_PSPM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiBuoyantSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   2000;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	fileUpdate
	{
	    type              timeActivatedFileUpdate;
	    libs              (utilityFunctionObjects);
	    writeControl      timeStep;
	    writeInterval     1;
	    fileToUpdate      "$FOAM_CASE/system/fvSolution";
	    timeVsFile
	    (
		(-1   "$FOAM_CASE/system/fvSolution1")
		(200  "$FOAM_CASE/system/fvSolution2")
		(400  "$FOAM_CASE/system/fvSolution3")
		(800  "$FOAM_CASE/system/fvSolution4")
	    );
	}
	
	    surfaceFieldValue1
{
    // Mandatory entries (unmodifiable)
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);

    // Mandatory entries (runtime modifiable)
    fields          (CO2);
    operation       weightedAverage;
    regionType      patch;
    name            outlet;

    // Optional entries (runtime modifiable)
    postOperation   none;
    weightField     phi;
    scaleFactor     1.0;
    writeArea       false;
    surfaceFormat   none;

    // Optional (inherited) entries
    writeFields     false;
    executeControl  timeStep;
    executeInterval 100;
    writeControl    timeStep;
    writeInterval   100;
}
}

// ************************************************************************* //
