testing_cases/officeDVTian2019_PSPM/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitTemperatureGas
{
	type            limitTemperature;
                min             273.15;
                //max            400;
                max            400;
                //phase          gas;
                selectionMode  all;
}

CO2Source
{
    type            scalarSemiImplicitSource;
    //active          true;
 
    //scalarSemiImplicitSourceCoeffs
    //{
        selectionMode   points; // all, cellSet, cellZone, points
        points
        (
            (2.401 0.95 1.00)
        );
        volumeMode      absolute; // absolute;
        injectionRateSuSp
        {
            CO2     (1.89468E-05 0);
        }
    //}
}

// ************************************************************************* //
